RuanJG/stm32App/source/app/app_Qipad.c
	adc_updated = 0;

}

void DMA1_Channel1_IRQHandler(void)
{
 if(DMA_GetITStatus(DMA1_IT_TC1))
 {
	 adc_updated = 1;
	 DMA_ClearITPendingBit(DMA1_IT_GL1);
 }
}


unsigned short Cali_Adc_Value(int id)
{
	int i;
	u32 max=0,min=0,tmp;
	u32 sensor = 0; 
	
	max = escADCConvert[0][id];	
	min = escADCConvert[0][id];
	for(i=0;i<ADC_SAMPLE_COUNT;i++)
	{
		tmp = escADCConvert[i][id];
		if( tmp > max ) max = tmp;
		if( tmp < min ) min = tmp;
		sensor += tmp;
	}
	sensor -= (max+min);
	sensor = sensor/(ADC_SAMPLE_COUNT-2);
	//sensor = sensor>>5;
	return sensor;
}



#define RED_LED_ADC_ID 0
#define WHITE1_LED_ADC_ID 1
#define WHITE2_LED_ADC_ID 2

#define RED_LED_HIGHT_LEVEL  30
#define WHITE1_LED_HIGHT_LEVEL 1000
#define WHITE2_LED_HIGHT_LEVEL 1000

volatile int red_led_adc , white1_led_adc, white2_led_adc;
void LED_Detection_init()
{
	ADC_Configuration ();
	red_led_adc = 0;
	white1_led_adc = 0;
	white2_led_adc = 0;
}


int is_red_led_on()
{
	if( adc_updated != 0 ){
		red_led_adc = Cali_Adc_Value(RED_LED_ADC_ID);
	}
	
	red_led_adc = 4096 - red_led_adc;
	_LOG("red adc=%d\n",red_led_adc);
	
	if( red_led_adc >= RED_LED_HIGHT_LEVEL ){
		return 1;
	}else{ 
		return 0;
	}
}

int is_white1_led_on()
{
	if( adc_updated != 0 ){
		white1_led_adc = Cali_Adc_Value(WHITE1_LED_ADC_ID);
	}
	
	white1_led_adc = 4096 - white1_led_adc;
	_LOG("white1 adc=%d\n",white1_led_adc);
	
	if( white1_led_adc >= WHITE1_LED_HIGHT_LEVEL ){
		return 1;
	}else{ 
		return 0;
	}
}

int is_white2_led_on()
{
	if( adc_updated != 0 ){
		white2_led_adc = Cali_Adc_Value(WHITE2_LED_ADC_ID);
	}
	
	white2_led_adc = 4096 - white2_led_adc;
	_LOG("white2 adc=%d\n",white2_led_adc);
	
	if( white2_led_adc >= WHITE2_LED_HIGHT_LEVEL ){
		return 1;
	}else{ 
		return 0;
	}
}


volatile int check_led_toggle_server_tag;
volatile int check_led_toggle_counter;
volatile int check_led_toggle_level;

void check_led_toggle_server_init()
{
	check_led_toggle_server_tag = 1;
	check_led_toggle_counter = 0;
	check_led_toggle_level = 0;
}

void check_led_toggle_server_event()
{
	int level;
	
	if( check_led_toggle_server_tag == 0) return;
	
	level = is_red_led_on() + is_white1_led_on() + is_white2_led_on();
	if( level == 3 ){
		if( check_led_toggle_level == 0 ){
			check_led_toggle_counter++;
		}
		check_led_toggle_level = level;
	}else{
		check_led_toggle_level = 0;
	}
	
}

void check_led_toggle_server_stop()
{
	check_led_toggle_server_tag = 0;
}

int is_check_led_toggle_server_start()
{
	return check_led_toggle_server_tag;
}







#define FALSE_LED_ON() GPIOB->BSRR = GPIO_Pin_8;
#define FALSE_LED_OFF() GPIOB->BRR = GPIO_Pin_8;
#define PASS_LED_ON() 	GPIOB->BSRR = GPIO_Pin_5;
#define PASS_LED_OFF()	GPIOB->BRR = GPIO_Pin_5;
#define RUNING_LEN_ON()	GPIOB->BSRR = GPIO_Pin_6;
#define RUNING_LEN_OFF()	GPIOB->BRR = GPIO_Pin_6;

void led_pin_config()
{
	GPIO_InitTypeDef GPIO_InitStructure;	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_5 | GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	FALSE_LED_OFF();
	PASS_LED_OFF();
	RUNING_LEN_ON();
}








/*
出厂时仪表波特率是9600,可以自行设置
每台设备出厂时通迅地址都是0x00

A:单次读取设备数据(设备接收到此命令后,向主机发送1次数据后回到等待状态)
0x88+0xAE+设备地址+0x11  实例88AE0011

B:连续读取设备数据(设备接收到此命令后,将以每秒6组的速度向主机连续发送数据)
0x88+0xAE+设备地址+0x21

C:停止设备输出数据,此命令不管当前工作的是哪一台设备,都将停止输出
0x88+0xAE+任意字节+0x01

D:设备返回给主机(PC)数据格式
0xFA+0xFB+设备地址+数据字节0+数据字节1+数据字节2+数据字节3+校验字节
数据由4个字节组成(注意:靠左的是低字节和习惯上是反的),接收后需要转换成浮点数才能对应设备显示数据.校验字节是4个数据字节相加的结果(进位舍去)
*/
typedef struct miniMeterCoder {
	unsigned char packet[8];
	unsigned char index;
	unsigned char addr;
	float 				value;
	Uart_t				*uart;
}miniMeterCoder_t;

void miniMeterCoder_init(miniMeterCoder_t * coder, Uart_t* uart)
{
	int i;
	for( i=0; i< sizeof(coder->packet); i++)
		coder->packet[i]=0;
	coder->index = 0;
	coder->addr = 0;
  coder->uart = uart;
}

int miniMeterCoder_prase( miniMeterCoder_t * coder, unsigned char data )
{
	unsigned char crc;
	unsigned char *value ;
	
	if( coder->index == 0  && data != 0xFA ) return 0;
	if( coder->index == 1 && data != 0xFB ) { coder->index = 0; return 0; }
	if( coder->index == 2  && data != coder->addr ) { coder->index = 0; return 0; }
	
	coder->packet[ coder->index++ ] = data;
	
	if( coder->index < sizeof(coder->packet) ) return 0;
	
	//check crc
	coder->index = 0;
	crc = coder->packet[3]+coder->packet[4]+coder->packet[5]+coder->packet[6];
	if( crc == coder->packet[7] ) {
		//coder->value = *((float*) &coder->packet[3] );
		value = (unsigned char *)&coder->value;
		value[0] = coder->packet[6];
		value[1] = coder->packet[5];
		value[2] = coder->packet[4];
		value[3] = coder->packet[3];
		return 1;
	}
	return 0;
}

int miniMeterCoder_read(miniMeterCoder_t * coder, float *value)
{
	unsigned char packget[8];
	int i,count;
	char res = 0;

	count = Uart_Get( coder->uart	, packget, sizeof( packget ) );
	if( count == 0 ) return 0;
	
	for( i=0; i< count ; i++){
		if( 1 == miniMeterCoder_prase( coder , packget[i] ) ){
			_LOG( "%.5fV" , coder->value);
			res = 1;
		}
	}
	
	return res;
}

void miniMeterCoder_clear( miniMeterCoder_t * coder )
{
	unsigned char tmp;
	
	coder->index = 0;
	if( coder->uart != NULL )
		while( Uart_Get( coder->uart	, &tmp, 1) );
}


#define A_METER_UART &Uart1
#define V_METER_UART &Uart3
miniMeterCoder_t currentMeter;
miniMeterCoder_t voltageMeter;

void miniMeter_init()
{
	miniMeterCoder_init( &currentMeter , A_METER_UART);
	miniMeterCoder_init( &voltageMeter , V_METER_UART);
}

void miniMeter_start(miniMeterCoder_t * coder)
{
	unsigned char packget[]={0x88,0xAE,0x00,0x21};
	
	Uart_Put(coder->uart, packget, sizeof( packget) );
}

void miniMeter_stop(miniMeterCoder_t * coder)
{
	unsigned char packget[]={0x88,0xAE,0x00,0x01};
	
	Uart_Put(coder->uart, packget, sizeof( packget) );
}

void miniMeter_toggle(miniMeterCoder_t * coder)
{
	unsigned char packget[]={0x88,0xAE,0x00,0x11};
	
	Uart_Put(coder->uart, packget, sizeof( packget) );
}



volatile char currentCali_server_tag = 0;
volatile float current_sum;
volatile int	current_counter;
void currentCali_server_start()
{
	miniMeterCoder_clear(&currentMeter );
	miniMeter_start( &currentMeter );
	currentCali_server_tag = 1;
	current_sum=0;
	current_counter=0;
}

void currentCali_server_even()
{
	float value;
	
