RuanJG/stm32App/source/app/app_Qipad.c
	if( currentCali_server_tag == 0 ) return;
	
	if( 1 == miniMeterCoder_read(&currentMeter, &value) ){
		current_sum += value;
		current_counter++;
	}
}
void currentCali_server_stop()
{
	miniMeter_stop( &currentMeter );
	currentCali_server_tag = 0;
}
int is_currentCali_server_start()
{
	return currentCali_server_tag;
}



volatile char voltageCali_server_tag = 0;
volatile float voltage_sum;
volatile int	voltage_counter;
void voltageCali_server_start()
{
	miniMeterCoder_clear(&voltageMeter );
	miniMeter_start( &voltageMeter );
	voltageCali_server_tag = 1;
	voltage_sum=0;
	voltage_counter=0;
}

void voltageCali_server_even()
{
	float value;
	
	if( voltageCali_server_tag == 0 ) return;
	
	if( 1 == miniMeterCoder_read(&voltageMeter, &value) ){
		voltage_sum += value;
		voltage_counter++;
	}
}
void voltageCali_server_stop()
{
	voltageCali_server_tag = 0;
	miniMeter_stop( &voltageMeter );
}
int is_voltageCali_server_start()
{
	return voltageCali_server_tag;
}

















#define VALVE_S1_ON()				GPIOA->BSRR = GPIO_Pin_7
#define VALVE_S1_OFF()			GPIOA->BRR = GPIO_Pin_7
#define VALVE_S2_ON()			GPIOA->BSRR = GPIO_Pin_6
#define VALVE_S2_OFF()			GPIOA->BRR = GPIO_Pin_6
#define VALVE_5V_ON()			GPIOA->BSRR = GPIO_Pin_15
#define VALVE_5V_OFF()			GPIOA->BRR = GPIO_Pin_15
#define VALVE_COIL_PANEL_ON()			GPIOA->BSRR = GPIO_Pin_1
#define VALVE_COIL_PANEL_OFF()			GPIOA->BRR = GPIO_Pin_1
#define VALVE_RECEIVE_PANEL_ON()			GPIOA->BSRR = GPIO_Pin_3
#define VALVE_RECEIVE_PANEL_OFF()			GPIOA->BRR = GPIO_Pin_3
#define VALVE_TEST_MODE_ON()			GPIOA->BSRR = GPIO_Pin_2
#define VALVE_TEST_MODE_OFF()			GPIOA->BRR = GPIO_Pin_2

void valve_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;	
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);

	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_1 | GPIO_Pin_15 | GPIO_Pin_6 | GPIO_Pin_7 |GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	VALVE_S1_OFF();
	VALVE_S2_OFF();
	VALVE_5V_OFF();
	VALVE_COIL_PANEL_OFF();
	VALVE_RECEIVE_PANEL_OFF();
	VALVE_TEST_MODE_OFF();
}








systick_time_t heart_led_timer;
BitAction heart_led;

void heart_led_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_InitStructure.GPIO_Pin=GPIO_Pin_13;
	GPIO_InitStructure.GPIO_Speed=GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode=GPIO_Mode_Out_PP ;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	systick_init_timer(&heart_led_timer, 500);
	heart_led = Bit_RESET;
	GPIO_WriteBit( GPIOC, GPIO_Pin_13 , heart_led);
	
}

void heart_led_even()
{
	
	
	if( systick_check_timer( &heart_led_timer ) ){
		heart_led = heart_led==Bit_RESET ? Bit_SET: Bit_RESET ;
		GPIO_WriteBit( GPIOC, GPIO_Pin_13 , heart_led);
	}
}



volatile int launch_switch;
volatile int pump_switch;

void Switch_irq_init(void)
{
	EXTI_InitTypeDef EXTI_InitStructure;  
	NVIC_InitTypeDef NVIC_InitStructure;	

	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);

	EXTI_InitStructure.EXTI_Line = EXTI_Line0;    
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;//EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);

	EXTI_InitStructure.EXTI_Line = EXTI_Line1;    
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;//EXTI_Trigger_Rising;
	EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	EXTI_Init(&EXTI_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	launch_switch = 0;
	pump_switch = 0;
	
}


void EXTI0_IRQHandler()
{
	launch_switch = launch_switch==0 ?1:0;
	EXTI_ClearITPendingBit(EXTI_Line0);
}

void EXTI1_IRQHandler()
{
	pump_switch = 1;
	EXTI_ClearITPendingBit(EXTI_Line1);
}





#define MS_COIL_PANEL_MOVE   1000
#define MS_RECEIVE_PANEL_MOVE 1000
#define MS_POWER_OFF_5V  200

enum SERVER_STEP{
	STEP_IDLE =0,
	STEP_PULL_DOWM_COIL_PANEL, 
	STEP_POWER_5V_UP,					
	STEP_CAIL_CURRENT,					
	STEP_CHECK_LED_TOGGLE,			
	STEP_PULL_DOWN_RECEIVE_PANEL, 
	STEP_CHECK_LED_ON,
	STEP_CHECK_VOL_CURRENT,
	STEP_S1_ON,
	STEP_S2_ON,
	STEP_CHECK_FINAL_CURRENT,
	STEP_FINISH
};

volatile enum SERVER_STEP test_step ;
systick_time_t delay_timer;



void service_break()
{	
	VALVE_5V_OFF();
	systick_delay_us(1000 );
	VALVE_RECEIVE_PANEL_OFF();
	systick_delay_us( MS_RECEIVE_PANEL_MOVE *1000 );
	VALVE_COIL_PANEL_OFF();
	systick_delay_us( MS_COIL_PANEL_MOVE *1000 );
	VALVE_S1_OFF();
	VALVE_S2_OFF();
	
	test_step = STEP_IDLE;
	systick_init_timer( &delay_timer, 10 );
}


void service_init()
{
	VALVE_5V_OFF();
	systick_delay_ms( MS_POWER_OFF_5V  );
	VALVE_RECEIVE_PANEL_OFF();
	systick_delay_ms( MS_RECEIVE_PANEL_MOVE );
	VALVE_COIL_PANEL_OFF();
	systick_delay_ms( MS_COIL_PANEL_MOVE );
	VALVE_S1_OFF();
	VALVE_S2_OFF();
	
	test_step = STEP_IDLE;
	systick_init_timer( &delay_timer, 10 );
}


void service_even()
{
	float value;
	
	//break;
	if( pump_switch == 1 ){
		service_break();
		launch_switch = 0;
		pump_switch = 0;
	}
	//stop
	if( launch_switch == 0  && test_step!= STEP_IDLE){
		service_init();
	}
	
	if( 0 == systick_check_timer( &delay_timer ) ){
		return;
	}
	
	switch( test_step ){
		case STEP_IDLE:{
			if( launch_switch == 1 ){
				//start test
				test_step++;
			}
			break;
		}
		case STEP_PULL_DOWM_COIL_PANEL:{
			PASS_LED_OFF();
			FALSE_LED_OFF();
			VALVE_COIL_PANEL_ON();
			systick_init_timer( &delay_timer, MS_COIL_PANEL_MOVE );
			test_step++;
			_LOG("******** STEP_PULL_DOWM_COIL_PANEL : Start\n");
			break;
		}
		case STEP_POWER_5V_UP:{
			VALVE_5V_ON();
			systick_init_timer( &delay_timer, 1000 );
			test_step++;
			_LOG("******** STEP_POWER_5V_UP : Start\n");
			break;
		}
		case STEP_CAIL_CURRENT:{
			if( !is_currentCali_server_start() ){
				//start
				currentCali_server_start();
				systick_init_timer( &delay_timer, 2000 );
				_LOG("******** STEP_CAIL_CURRENT Start...\n");
			}else{
				//check result
				currentCali_server_stop();
				if( current_counter > 0 ){
					value = current_sum/current_counter;
					if( value >= 0.0001 && value <= 0.001 ){
						test_step++;
						systick_init_timer( &delay_timer, 1);
						_LOG("STEP_CAIL_CURRENT OK\n");
						break;
					}
				}else{
					_LOG("STEP_CAIL_CURRENT : no current data\n");
				}
				_LOG("STEP_CAIL_CURRENT : false\n");
				FALSE_LED_ON();
				test_step = STEP_FINISH;
				systick_init_timer( &delay_timer, 100 );
			}
			break;
		}
		case STEP_CHECK_LED_TOGGLE:{
			if( !is_check_led_toggle_server_start() ){
				check_led_toggle_server_init();
				systick_init_timer( &delay_timer, 4000 );
				_LOG("******** STEP_CHECK_LED_TOGGLE : Start\n");
			}else{
				check_led_toggle_server_stop();
				if( check_led_toggle_counter == 3 ){
					test_step++;
					systick_init_timer( &delay_timer, 1);
					_LOG("STEP_CHECK_LED_TOGGLE : OK\n");
				}else{
					_LOG("STEP_CHECK_LED_TOGGLE : false\n");
					FALSE_LED_ON();
					test_step = STEP_FINISH;
					systick_init_timer( &delay_timer, 100 );
				}
			}
			break;
		}
		case STEP_PULL_DOWN_RECEIVE_PANEL:{ // place the receive 
			VALVE_RECEIVE_PANEL_ON();
			systick_init_timer( &delay_timer, MS_RECEIVE_PANEL_MOVE + 500); // 500 for led light
			test_step++;
			_LOG("******** STEP_PULL_DOWN_RECEIVE_PANEL : Start\n");
			break;
		}
		
		case STEP_CHECK_LED_ON:{ // 2 white led is on , wait at least 3s before next step 
			if( 1 == is_white1_led_on() && 1 == is_white2_led_on() && 0==is_red_led_on() ){
				test_step++;
				systick_init_timer( &delay_timer, 3000);
				_LOG("******** STEP_CHECK_LED_ON : OK\n");
			}else{
				_LOG("STEP_CHECK_LED_ON : false\n");
				FALSE_LED_ON();
				test_step = STEP_FINISH;
				systick_init_timer( &delay_timer, 100 );
			}
			break;
		}
		case STEP_CHECK_VOL_CURRENT:{  // V=[5,5.5] A= [1.4,1.7]
			if( !is_currentCali_server_start() && !is_voltageCali_server_start() ){
				currentCali_server_start();
				voltageCali_server_start();
				systick_init_timer( &delay_timer, 2000 );
				_LOG("******** STEP_CHECK_VOL_CURRENT : Start\n");
			}else{
				voltageCali_server_stop();
				currentCali_server_stop();
				if( current_counter > 0 && voltage_counter > 0 ){
					value = current_sum/current_counter;
					if( value > 1.7 || value < 1.4 ){
						_LOG("STEP_CHECK_VOL_CURRENT : current[1.4,1.7] false (%fA)\n",value);
					}else{
						value = voltage_sum/voltage_counter;
						if( value > 5.5 || value < 5.0 ){
							_LOG("STEP_CHECK_VOL_CURRENT : voltage[5.0,5.5] false (%fV)\n",value);
						}else{
							test_step++;
							systick_init_timer( &delay_timer, 100 );
							_LOG("STEP_CHECK_VOL_CURRENT : OK\n");
							break;
						}
					}
				}else{
					_LOG("STEP_CHECK_VOL_CURRENT : leak data  current(%d),voltage(%d)\n",current_counter,voltage_counter);
				}
				_LOG("STEP_CHECK_VOL_CURRENT : false\n");
				FALSE_LED_ON();
				test_step = STEP_FINISH;
				systick_init_timer( &delay_timer, 100 );
			}
			break;
		}
		case STEP_S1_ON:{ // red led is on 
			if( !is_check_led_toggle_server_start() ){
				VALVE_S1_ON();
				check_led_toggle_server_init();
				systick_init_timer( &delay_timer, 500 );
				_LOG("******** STEP_S1_ON : Start\n");
			}else{
				check_led_toggle_server_stop();
				if( is_red_led_on() ){
					test_step++;
					_LOG("STEP_S1_ON : OK\n");
				}else{
					_LOG("STEP_S1_ON : false\n");
					FALSE_LED_ON();
					test_step = STEP_FINISH;
				}
				VALVE_S1_OFF();
				systick_init_timer( &delay_timer, 100 );
			}
			break;
		}	
		case STEP_S2_ON:{ // all leds are off, current= [0.1mA,1mA]
			if( !is_currentCali_server_start() ){
				//start
				VALVE_S2_ON();
				currentCali_server_start();
				systick_init_timer( &delay_timer, 2000 );
				_LOG("******** STEP_S2_ON : Start\n");
			}else{
				//check result
				currentCali_server_stop();
				if( is_red_led_on() || is_white1_led_on() || is_white2_led_on() ){
					_LOG("STEP_S2_ON : false,  led is light\n");
				}else{
					if( current_counter <=  0 ){
						_LOG("STEP_S2_ON : no current data\n");
					}else{
						value = current_sum/current_counter;
						if( value >= 0.0001 && value <= 0.001 ){
							test_step++;
							systick_init_timer( &delay_timer, 500); // 500ms for switch origan status for next test
							VALVE_S2_OFF();
							_LOG("STEP_S2_ON : OK\n");
							break;
						}else{
							_LOG("STEP_S2_ON :current[0.0001,0.001] false  %fA\n",value);
						}
						
