RuanJG/stm32App/source/app/app_Qipad.c
					}
				}
				_LOG("STEP_S2_ON : false\n");
				FALSE_LED_ON();
				test_step = STEP_FINISH;
				systick_init_timer( &delay_timer, 100 );
				VALVE_S2_OFF();
			}
			break;
		}
		case STEP_CHECK_FINAL_CURRENT:{  //all leds are off(3s内), current= [0.1mA,1mA]
			if( !is_currentCali_server_start() ){
				currentCali_server_start();
				systick_init_timer( &delay_timer, 2500 );
				_LOG("******** STEP_CHECK_FINAL_CURRENT: Start\n");
			}else{
				//check result
				currentCali_server_stop();
				if( is_red_led_on() || is_white1_led_on() || is_white2_led_on() ){
					_LOG("STEP_CHECK_FINAL_CURRENT :  led is on \n");
				}else{
					if( current_counter > 0 ){
						value = current_sum/current_counter;
						if( value >= 0.0001 && value <= 0.001 ){
							test_step++;
							systick_init_timer( &delay_timer, 1);
							PASS_LED_ON();
							_LOG("STEP_CHECK_FINAL_CURRENT: OK\n");
							break;
						}else{
							_LOG("STEP_CHECK_FINAL_CURRENT : current[0.0001,0.001] false  %fA\n",value);
						}
					}else{
						_LOG("STEP_CHECK_FINAL_CURRENT : no current data\n");
					}
				}
				_LOG("STEP_CHECK_FINAL_CURRENT : false\n");
				FALSE_LED_ON();
				test_step = STEP_FINISH;
				systick_init_timer( &delay_timer, 100 );
			}
			break;
		}		
		case STEP_FINISH:{
			_LOG("STEP_FINISH: finish\n");
			service_init();
			launch_switch = 0;
			break;
		}
		default:{
			service_init();
			launch_switch = 0;
			_LOG("Server: ERROR ! get a unknow setp\n");
			break;
		}
	}
}









void cmd_even()
{
	static char buffer[4]={0};
	static char index = 0;
	
	//if( Uart_Get( CONSOLE_UART , (unsigned char*) &buffer[index], 1 ) ){
	if( USB_RxRead((unsigned char*) &buffer[index], 1 ) ){
		if( buffer[index] == ';' ){
			if( index == 2 ){
				switch( buffer[index -2 ]){
					case '1':
						if( buffer[index-1]== '1' ){
							VALVE_S1_ON();
							_LOG("1-S1 ON \n");
						}else{
							VALVE_S1_OFF();
							_LOG("1-S1 OFF \n");
						}
						break;
					case '2':
						if( buffer[index-1]== '1' ){
							VALVE_S2_ON();
							_LOG("2-S2 ON \n");
						}else{
							VALVE_S2_OFF();
							_LOG("2-S2 OFF \n");
						}
						break;								
					case '3':
						if( buffer[index-1]== '1' ){
							VALVE_5V_ON();
							_LOG("3-5V ON \n");
						}else{
							VALVE_5V_OFF();
							_LOG("3-5V OFF \n");
						}
						break;		

						
					case '4':
						if( buffer[index-1]== '1' ){
							VALVE_COIL_PANEL_ON();
							_LOG("4-VALVE_COIL_PANEL ON \n");
						}else{
							VALVE_COIL_PANEL_OFF();
							_LOG("4-VALVE_COIL_PANEL OFF \n");
						}
						break;						
					case '5':
						if( buffer[index-1]== '1' ){
							VALVE_RECEIVE_PANEL_ON();
							_LOG("5-VALVE_RECEIVE_PANEL ON \n");
						}else{
							VALVE_RECEIVE_PANEL_OFF();
							_LOG("5-VALVE_RECEIVE_PANEL OFF \n");
						}
						break;
					case '6':
						if( buffer[index-1]== '1' ){
							VALVE_TEST_MODE_ON();
							_LOG("VALVE_TEST_MODE_ON ON \n");
						}else{
							VALVE_TEST_MODE_OFF();
							_LOG("VALVE_TEST_MODE_ON OFF \n");
						}
						//	voltageCali_server_start();
						//	currentCali_server_start();
					break;
					case '7':
							if( buffer[index-1] == 'r') {RUNING_LEN_ON();}
							else if(buffer[index-1] == 'p') {PASS_LED_ON();}
							else if(buffer[index-1] == 'f') {FALSE_LED_ON();}
							break;
					case '8':
							if( buffer[index-1] == 'r') {RUNING_LEN_OFF();}
							else if(buffer[index-1] == 'p') {PASS_LED_OFF();}
							else if(buffer[index-1] == 'f') {FALSE_LED_OFF();}
					break;
				}
			}
			index = 0;
			return;
		}
		index++;
		index = index % 4;
	}
}




void app_init()
{
	valve_init();
	
	Uart_init();

#if BOARD_HAS_IAP
	if( IAP_PORT_USB == 1 ) iap_init_in_usb();
#endif
	//console_init( CONSOLE_UART_TYPE ,CONSOLE_UART );
	console_init( CONSOLE_USB_TYPE ,NULL );
	

	heart_led_init();
	LED_Detection_init();
	led_pin_config();
	miniMeter_init();
	Switch_irq_init();
	service_init();

}


void app_event()
{
	check_led_toggle_server_event();
	currentCali_server_even();
	voltageCali_server_even();
	heart_led_even();
	service_even();
	
	cmd_even();
	/*
	if( voltage_counter >= 6 ){
		voltageCali_server_stop();
		_LOG("Vmeter=%f\n",voltage_sum/voltage_counter);
		voltageCali_server_start();
	}
	if( current_counter >= 6 ){
		currentCali_server_stop();
		_LOG("Ameter=%f\n",current_sum/current_counter);
		currentCali_server_start();
	}
	*/
}










#endif
